---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowTreadFaces
source: html/133d62d5-9f8a-3d55-50b3-1ad1e5bf0ca2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowTreadFaces Property

"Show Run's Tread Faces"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowTreadFaces { get; }
```